- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["dev"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-dev-dlq]
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=EKGC0XQKA7JD2]
module.frontend_bucket["dev"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=E1PD6WU5V1CUGV]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=bata-media-db-backup]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod-dlq]
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=bata-media-frontend-prod]
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=bata-media-photo-dev]
module.processing_queue["dev"].data.archive_file.processing_lambda_source: Read complete after 1s [id=e173c89c365b1ba4e8405c772d047ba707465c33]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=e173c89c365b1ba4e8405c772d047ba707465c33]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.frontend_bucket["dev"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=bata-media-frontend-dev]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E2L20GH2AV9ZRW]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.photo_bucket["dev"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E1WYWDHASMVEQA]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
module.processing_queue["dev"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-dev-execution-role]
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-dev]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["dev"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-dev]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=2010748321]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=2321525610]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["dev"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/media-photo-processing-dev-processing-policy]
module.processing_queue["dev"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-dev-execution-role-20250328201712588400000009]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20250328201712565400000008]
module.processing_queue["dev"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=c0301e00-3691-4728-8a28-6dc1f3192bfb]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=016be879-7beb-4bdb-af72-9f3abcf6f087]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=bata-media-db-backup]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=bata-media-db-backup-db-backup-user]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-db-backup-db-backup-policy]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=bata-media-db-backup]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-photo-prod-upload-policy]
module.photo_bucket["dev"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-photo-dev-upload-user]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["dev"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-photo-dev-upload-policy]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1452836004]
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=541435747]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-photo-prod-upload-user]
module.photo_bucket["dev"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=bata-media-photo-dev]
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=bata-media-photo-dev]
module.photo_bucket["dev"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=bata-media-photo-dev]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=bata-media-photo-dev]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1577279431]
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1293561378]
module.frontend_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-frontend-prod-upload-user]
module.frontend_bucket["dev"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-frontend-dev-upload-user]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E38Z5KAIBO7480]
module.frontend_bucket["dev"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E29PRQNJ1ERH3T]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=bata-media-frontend-dev]
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=bata-media-frontend-dev]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=bata-media-db-backup-db-backup-user-20250328201628443000000007]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=bata-media-frontend-dev]
module.photo_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-photo-dev-upload-user-2025032820173572350000000a]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-photo-prod-upload-user-2025032820173573590000000b]
module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy]
module.frontend_bucket["dev"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-frontend-dev-upload-policy]
module.frontend_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-frontend-dev-upload-user-2025032820223430640000000c]
module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-frontend-prod-upload-user-2025032820223431810000000d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket_acl.mysql_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "mysql_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-db-backup"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "s3_bucket_acl_ownership" {
      + bucket = "bata-media-db-backup"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_acl.frontend_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "frontend_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-frontend-dev"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.frontend_bucket["dev"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "s3_bucket_acl_ownership" {
      + bucket = "bata-media-frontend-dev"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "frontend_s3_bucket_acl" {
      + acl    = "private"
      + bucket = "bata-media-frontend-prod"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "s3_bucket_acl_ownership" {
      + bucket = "bata-media-frontend-prod"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.photo_bucket["dev"].aws_cloudfront_distribution.photo_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "photo_cloudfront_distribution" {
      + aliases                         = [
          + "photos.dev.foto.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-photo-dev"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "origin1"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "bata-media-photo-dev.s3.eu-west-1.amazonaws.com"
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E1WYWDHASMVEQA"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/c8660770-d8c2-4976-9d95-145289b45c1e"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.photo_bucket["dev"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "photo_cloudfront_response_headers_policy" {
      + arn     = (known after apply)
      + comment = "Policy to ensure CORS headers are always passed on photos, even if they're cached without."
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "MediaCorsResponseHeadersPolicy-dev"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 600
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Authorization",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "GET",
                  + "POST",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "http://localhost",
                  + "http://localhost:3000",
                  + "https://dev.foto.batavierenrace.nl",
                  + "https://www.dev.foto.batavierenrace.nl",
                ]
            }
        }
    }

  # module.photo_bucket["dev"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "photo_s3_bucket_cors" {
      + bucket = "bata-media-photo-dev"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "http://localhost",
              + "http://localhost:3000",
              + "https://dev.foto.batavierenrace.nl",
              + "https://www.dev.foto.batavierenrace.nl",
            ]
          + expose_headers  = []
            id              = null
        }
    }

  # module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "photo_cloudfront_distribution" {
      + aliases                         = [
          + "photos.foto.batavierenrace.nl",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Cloudfront proxy for bata-media-photo-prod"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "origin1"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "bata-media-photo-prod.s3.eu-west-1.amazonaws.com"
          + origin_id                = "origin1"
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2L20GH2AV9ZRW"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:172483268424:certificate/411d3e09-0a4e-4ed1-b73d-9c7e69d9d2da"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "photo_cloudfront_response_headers_policy" {
      + arn     = (known after apply)
      + comment = "Policy to ensure CORS headers are always passed on photos, even if they're cached without."
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "MediaCorsResponseHeadersPolicy-prod"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 600
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Authorization",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "GET",
                  + "POST",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://foto.batavierenrace.nl",
                  + "https://www.foto.batavierenrace.nl",
                ]
            }
        }
    }

  # module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "photo_s3_bucket_cors" {
      + bucket = "bata-media-photo-prod"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://foto.batavierenrace.nl",
              + "https://www.foto.batavierenrace.nl",
            ]
          + expose_headers  = []
            id              = null
        }
    }

  # module.processing_queue["dev"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-dev"
      ~ last_modified                  = "2025-03-28T20:16:26.641+0000" -> (known after apply)
      ~ source_code_hash               = "Ea7KQP/8PPegccD2BfU6y1kjaxt16RHCnG2P5Fa/wag=" -> "wfd9QqA1d3nolhpEEqFyYFVQey5pDvoXbcaic3pYvxg="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-03-28T20:16:35.899+0000" -> (known after apply)
      ~ source_code_hash               = "Ea7KQP/8PPegccD2BfU6y1kjaxt16RHCnG2P5Fa/wag=" -> "wfd9QqA1d3nolhpEEqFyYFVQey5pDvoXbcaic3pYvxg="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 2 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 26, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  26:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*